УТ_для_edt/src/InformationRegisters/смартОграничениеПродажиНоменклатурыПоКоличеству/смартОграничениеПродажиНоменклатурыПоКоличеству.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>смартОграничениеПродажиНоменклатурыПоКоличеству</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КвотаДляДилера</name>
    <comment>//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИспользоватьКвотуДляДилера</name>
    <comment>//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок</comment>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

УТ_для_edt/src/InformationRegisters/смартОграничениеПродажиНоменклатурыПоКоличеству/Forms/ФормаСписка/Module.bsl
//++ #1319 смарт: Фролов 28.02.2023 //Ограничение количества продаж и отмена скидок
&НаСервере
Процедура ИспользоватьКвотыДляСтрокНаСервере(Пометка)
	Для Каждого Стр Из ЭтаФорма.ПодчиненныеЭлементы.Список.ВыделенныеСтроки Цикл
		МЗ=РегистрыСведений.смартОграничениеПродажиНоменклатурыПоКоличеству.СоздатьМенеджерЗаписи();
		МЗ.Номенклатура=Стр.Номенклатура;
		МЗ.Прочитать();
		Если МЗ.Выбран() Тогда
			МЗ.ИспользоватьКвотуДляДилера=Пометка;	
		КонецЕсли;
		МЗ.Записать(Истина);
	КонецЦикла;	
КонецПроцедуры 

&НаСервере
Процедура УстановитьКвотыДляСтрокНаСервере(Результат)
    Если Не Результат = Неопределено Тогда
		Для Каждого Стр Из ЭтаФорма.ПодчиненныеЭлементы.Список.ВыделенныеСтроки Цикл
			МЗ=РегистрыСведений.смартОграничениеПродажиНоменклатурыПоКоличеству.СоздатьМенеджерЗаписи();
			МЗ.Номенклатура=Стр.Номенклатура;
			МЗ.Прочитать();
			Если МЗ.Выбран() Тогда
				МЗ.КвотаДляДилера=Результат;	
			КонецЕсли;
			МЗ.Записать(Истина);
		КонецЦикла;	
	КонецЕсли; 
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКвотыДляСтрок(Команда) 
	ИспользоватьКвотыДляСтрокНаСервере(Истина); 
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура НеИспользоватьКвотыДляСтрок(Команда)
	ИспользоватьКвотыДляСтрокНаСервере(Ложь); 
	Элементы.Список.Обновить();
КонецПроцедуры  

&НаКлиенте
Процедура УстановитьКвотыДляВыделенныхСтрок(Команда)
    Оповещение = Новый ОписаниеОповещения("ПослеВводаЧисла",ЭтаФорма);
    ПоказатьВводЧисла(Оповещение,,"Установите значение квоты",3, 0 ); 
КонецПроцедуры
 
&НаКлиенте
Процедура ПослеВводаЧисла(Результат, Параметры) Экспорт
	УстановитьКвотыДляСтрокНаСервере(Результат);
	Элементы.Список.Обновить();
КонецПроцедуры
//-- #1319 смарт: Фролов 28.02.2023
